04_Simulation/1.FROZEN/PH_2D_kOmegaSSTx_GEP_LAV_pimpleURANS_540x590_aij_xt/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  RASModel;

RAS
{
    RASModel        kOmegaSST; //kOmegaSSTx;

    turbulence      on;

    printCoeffs     on;
}

// ************************************************************************* //
